#+TITLE: DM2 Assignment 09.3
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"generic-instructions.org")][Read Instructions]]
[[elisp:(progn%20(save-buffer)%20(browse-url-of-file%20(org-html-export-to-html)))][Export to HTML and Browse]]
[[elisp:(progn%20(save-buffer)%20(org-clock-report%201)%20(save-buffer))][Insert/Update Clock Summary Report]]
*** Make-Frequency-Table

#+BEGIN_SRC elisp
  (setq list-of-gaps (list-the-gaps)
        len (length list-of-gaps))
#+END_SRC

#+RESULTS:
: 9999998

--> Show the last several lines
#+BEGIN_SRC elisp
   (subseq list-of-gaps 9999988) 
#+END_SRC

#+RESULTS:
| 18 | 20 | 6 | 24 | 10 | 6 | 12 | 38 | 4 | 2 |

--> Here is the function that was requested.
#+name: make-frequency-table
#+BEGIN_SRC elisp :results silent

  (defun make-frequency-table (lst-of-gaps)
    "Make it!"
    (let ((freq-table (make-hash-table)))
      (loop for gap in lst-of-gaps
            do (incf (gethash gap freq-table 0)))
    freq-table))
#+END_SRC

-> Set the hashmap as a global value
#+BEGIN_SRC elisp :results silent
  (setq f-table (make-frequency-table list-of-gaps))   
#+END_SRC

-> Here is the result!
#+BEGIN_SRC elisp
  f-table
#+END_SRC

#+RESULTS:
: #s(hash-table size 145 test eql rehash-size 1.5 rehash-threshold 0.8125 data (2 738597 4 738717 6 1297540 8 566151 14 503524 10 729808 12 920661 18 667734 20 354267 22 307230 34 129043 24 453215 16 371677 26 211203 28 229177 30 398713 32 123123 36 206722 44 64866 42 159956 40 111546 52 38800 48 93693 38 94682 72 17255 50 52183 62 16763 54 64157 60 55305 58 27985 46 54931 56 32224 64 17374 68 12368 86 3411 66 30960 70 17475 78 13758 76 7253 82 4791 96 3544 112 711 100 1923 74 8540 90 7056 84 9818 114 1125 80 6760 88 3454 98 1831 92 2259 106 933 94 2058 118 433 132 301 104 1168 102 2374 110 941 126 533 120 948 148 67 108 1634 122 287 138 210 128 183 154 43 130 211 116 439 146 46 136 100 124 318 134 128 140 140 152 52 142 90 144 123 150 94 180 10 156 57 164 20 210 4 170 18 160 27 182 5 168 25 176 11 172 4 162 27 178 12 198 6 220 1 158 19 174 10 196 1 184 4 166 9 202 2 204 3 222 1 192 3 188 1 190 1 186 3 194 1))

*** Make-Node-List-From-Table

--> Example of maphash function 
(EXCEPT it Returns NIL has no other collection mechanism)
#+BEGIN_SRC elisp :results silent
  (maphash (lambda (key val)
            (list "cstring" key val))
   f-table)
#+END_SRC

--> Example of looping over both KEYS and VALUES
#+BEGIN_SRC elisp :results silent
  (loop for key being the hash-keys of f-table 
        using (hash-value value)
        collect (list key value))
#+END_SRC

--> Let's make the list of nodes! 
(We do it in a let here first for experimentation.)
#+BEGIN_SRC elisp :results silent

  ;; Set node-counter to 0 so that the nodes 
  ;; have n0+ names rather than much larger ones.
  (setq node-counter 0)

  (defun make-node ()
    (let ((symbol (intern (concat "n" (number-to-string node-counter)))))
      (setf (symbol-plist symbol) nil)
      (set symbol node-counter)
      (incf node-counter)
      symbol))

  (defun make-node-with-properties (length frequency)
    (let ((symbol (intern (concat "n" (number-to-string node-counter)))))
      ;; If the symbol already exists in the obarray, it may not have an empty property list
      ;; clear property list of interned symbol
      (setf (symbol-plist symbol) nil)
      (set symbol frequency)
      ;; set the gap-length (of the node) in the node's plist
      (put symbol :gap-length length)
      ;; set the frequency (of the node) in the node's plist
      (put symbol :frequency frequency)
      ;; set an empty code in the plist
      (put symbol :code "")
      (incf node-counter)
      symbol))

#+END_SRC

-> play with exp-node-list to see if the plist got set right.
#+BEGIN_SRC elisp :results code

  ;(symbol-plist (nth 0 exp-node-list)) ;-> Works. Has :gap-length and :frequency
  ;(get-value (nth 0 exp-node-list)) ;-> Works! gets 738597 or whatever it is for 2
  ;(nth 0 exp-node-list) ;-> "n0" or n0 depending on the ouptut
  
#+END_SRC

#+RESULTS:
#+begin_src elisp
(:gap-length 2 :frequency 738597)
#+end_src

---> Here is the actual Function make-node-list-from-table
#+BEGIN_SRC elisp :results silent
  (defun make-node-list-from-table (ft)
    (setq node-counter 0)
    (loop for key being the hash-keys of ft 
          using (hash-value value)
          collect (make-node-with-properties key value)))

#+END_SRC

#+BEGIN_SRC elisp
  (setq list-of-nodes (make-node-list-from-table f-table))
#+END_SRC

#+RESULTS:
| n0 | n1 | n2 | n3 | n4 | n5 | n6 | n7 | n8 | n9 | n10 | n11 | n12 | n13 | n14 | n15 | n16 | n17 | n18 | n19 | n20 | n21 | n22 | n23 | n24 | n25 | n26 | n27 | n28 | n29 | n30 | n31 | n32 | n33 | n34 | n35 | n36 | n37 | n38 | n39 | n40 | n41 | n42 | n43 | n44 | n45 | n46 | n47 | n48 | n49 | n50 | n51 | n52 | n53 | n54 | n55 | n56 | n57 | n58 | n59 | n60 | n61 | n62 | n63 | n64 | n65 | n66 | n67 | n68 | n69 | n70 | n71 | n72 | n73 | n74 | n75 | n76 | n77 | n78 | n79 | n80 | n81 | n82 | n83 | n84 | n85 | n86 | n87 | n88 | n89 | n90 | n91 | n92 | n93 | n94 | n95 | n96 | n97 | n98 | n99 | n100 | n101 | n102 | n103 |

*** Make-Huffman-Tree

--> Psuedo Code
#+BEGIN_SRC elisp :results silent

  ;;;; PSEUDOCODE ==> Supplied by Bro Neff in textbook.
  ;; 
  ;; Algorithm Huffman Tree (inputs and initialization of Q as above)
  ;; while Q has more than one element do
  ;;    TL ← the minimum-weight tree in Q
  ;;    Delete the minimum-weight tree in Q
  ;;    TR ← the minimum-weight tree in Q
  ;;    Delete the minimum-weight tree in Q
  ;;    Create a new tree T with TL and TR as its left and right subtrees,
  ;;    and weight equal to the sum of TL’s weight and TR’s weight.
  ;;    Insert T into Q.
  ;; return T

#+END_SRC

--> make-huffman-tree function (with helper functions)
#+BEGIN_SRC elisp :results silent

  (defun append-code-to-subtree (strCode node)
    ;; add it to this tree
    ;; pass it on to the children if they exist..
    (if (not (eq nil (get node :left))) 
      (append-code-to-subtree strCode 
        (get node :left)))
    (if (not (eq nil (get node :right)))
      (append-code-to-subtree strCode 
        (get node :right)))
    (if (eq nil (get node :code)) (put node :code ""))
    (put node :code 
      (concat strCode 
              (get node :code))))

  (defun sym-greater-than (n1 n2)
    (and (integerp (get-value n1)) (integerp (get-value n2))
    (< (get-value n1) (get-value n2))))

  (defun make-huffman-tree (lst-of-nodes) 
    (let* ((Q lst-of-nodes)
           (x t)
           (T nil)
           (TL nil)
           (TR nil)
           (sum 0))
      (while (> (length Q) 1)
        (setq Q (sort Q 'sym-greater-than)) 
        (setq TL (car Q))
        (pop Q)
        (setq TR (car Q))
        (pop Q)
        (setq T (make-node))
        (set-value T
                   (+ (get-value TL)
                      (get-value TR)))
        (link-children-and-parent T TL TR)
        ;; HANDLE tree-leaves (initialize code to "")
        (if (eq nil (get TL :code)) (put TL :code ""))
        (if (eq nil (get TR :code)) (put TR :code ""))
        ;; add "0" to all SUBTREES on the LEFT LEFTs
        (append-code-to-subtree "0" TL)
        ;; add "1" to all RIGHTs
        (append-code-to-subtree "1" TR)
        ;; determine 
        
        (setq Q (cons T Q))
        ;;(setq sum (+ 1 sum)) ;; count how many iterations we get through..
        )

      (car Q)
      ))

#+END_SRC
#+BEGIN_SRC elisp
  ;; we will redo the list-of-nodes (which restarts the node-counter).
  (setq list-of-nodes (make-node-list-from-table f-table))
  (setq backup-list-of-nodes ;; We 
    (loop for sym in list-of-nodes
          collect sym))
  (setq huffman-tree (make-huffman-tree list-of-nodes))
#+END_SRC
#+RESULTS:
: n206

--> Let's investigate the results...
#+BEGIN_SRC elisp :results silent
  (loop for s in backup-list-of-nodes
        collect (symbol-plist s))
#+END_SRC
#+BEGIN_SRC elisp
  (list (length list-of-nodes)
        (length backup-list-of-nodes)
        list-of-nodes
        backup-list-of-nodes)
#+END_SRC

#+RESULTS:
| 18 | 104 | (n0 n1 n192 n193 n6 n194 n195 n196 n2 n197 n198 n199 n200 n201 n202 n203 n204 n205) | (n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 n19 n20 n21 n22 n23 n24 n25 n26 n27 n28 n29 n30 n31 n32 n33 n34 n35 n36 n37 n38 n39 n40 n41 n42 n43 n44 n45 n46 n47 n48 n49 n50 n51 n52 n53 n54 n55 n56 n57 n58 n59 n60 n61 n62 n63 n64 n65 n66 n67 n68 n69 n70 n71 n72 n73 n74 n75 n76 n77 n78 n79 n80 n81 n82 n83 n84 n85 n86 n87 n88 n89 n90 n91 n92 n93 n94 n95 n96 n97 n98 n99 n100 n101 n102 n103) |

*** Get-A-Gap-Code-Table

#+BEGIN_SRC elisp :results silent

  ;;;; PSEUDOCODE
  ;; ==> get h-tree, return list of codes (gap . code)
  ;; traverse the tree....
  ;; build the code...
  ;; START with an empty string.
  ;; traverse the tree (recursive)
  ;; Add 0's when you go LEFT, 
  ;; Add 1's when you go RIGHT,
  ;; GENERATE A BIT STRING FOR EVERY LEAF-NODE (not  (AND ADD TO THE LIST)
  
#+END_SRC

#+BEGIN_SRC elisp :results silent
  
  (defun get-a-gap-code-table ()
    (let* ((nodes backup-list-of-nodes))
      (loop for node in nodes
            collect 
            (cons (get node :gap-length)
                  (get node :code)
                  ))))

#+END_SRC

-> This is the usage..
#+BEGIN_SRC elisp
  (setq gap-code-table (get-a-gap-code-table))
#+END_SRC

#+RESULTS:
: ((2 . 1100) (4 . 1101) (6 . 100) (8 . 0101) (14 . 0100) (10 . 1011) (12 . 000) (18 . 0111) (20 . 10101) (22 . 01101) (34 . 011000) (24 . 0010) (16 . 11100) (26 . 111110) (28 . 111111) (30 . 11101) (32 . 001110) (36 . 111101) (44 . 0011111) (42 . 101000) (40 . 001100) (52 . 01100111) (48 . 1010010) (38 . 1010011) (72 . 011001011) (50 . 11110001) (62 . 011001010) (54 . 0011110) (60 . 11110011) (58 . 00110101) (46 . 11110010) (56 . 01100100) (64 . 011001100) (68 . 1111000010) (86 . 00110100100) (66 . 00110110) (70 . 011001101) (78 . 001101000) (76 . 0011011101) (82 . 11110000001) (96 . 00110111000) (112 . 11110000110100) (100 . 001101111001) (74 . 0011011111) (90 . 0011010011) (84 . 1111000001) (114 . 0011011110111) (80 . 11110000111) (88 . 00110100101) (98 . 001101110011) (92 . 111100000000) (106 . 0011011100101) (94 . 001101111010) (118 . 111100001101011) (132 . 111100001100100) (104 . 1111000011000) (102 . 111100000001) (110 . 0011011110000) (126 . 00110111101100) (120 . 0011011110001) (148 . 00110111101101001) (108 . 1111000011011) (122 . 001101111011011) (138 . 1111000011010101) (128 . 1111000011001110) (154 . 111100001100101110) (130 . 001101110010010) (116 . 00110111001000) (146 . 111100001101010000) (136 . 11110000110101001) (124 . 111100001100110) (134 . 0011011110110101) (140 . 1111000011001010) (152 . 00110111001001100) (142 . 11110000110011110) (144 . 0011011100100111) (150 . 11110000110011111) (180 . 11110000110010110011) (156 . 00110111101101000) (164 . 1111000011001011011) (210 . 001101110010011011111) (170 . 1111000011001011000) (160 . 1111000011010100011) (182 . 111100001100101111010) (168 . 1111000011010100010) (176 . 11110000110010111110) (172 . 001101110010011011100) (162 . 001101110010011010) (178 . 11110000110010111111) (198 . 00110111001001101100) (220 . 00110111001001101101100) (158 . 1111000011001011010) (174 . 11110000110010111100) (196 . 00110111001001101101101) (184 . 001101110010011011101) (166 . 11110000110010110010) (202 . 0011011100100110110111) (204 . 1111000011001011110110) (222 . 00110111001001101111010) (192 . 1111000011001011110111) (188 . 00110111001001101111011) (190 . 00110111001001101111000) (186 . 001101110010011011010) (194 . 00110111001001101111001))

-> Let's investigate the results...
#+BEGIN_SRC elisp :results silent
  (subseq gap-code-table 0 4)
#+END_SRC

*** Encode the Data (the first-ten-million-primes (List-of-Gaps))


--> Helper func. Get it working.
#+BEGIN_SRC elisp :results silent
  (defun get-code-of-gap (gapNum)
    (cdr (assoc gapNum gap-code-table))
  )
#+END_SRC

--> Verify the function
#+BEGIN_SRC elisp
  (list (get-code-of-gap 6)
        (get-code-of-gap 12)
        (get-code-of-gap 2)
        (get-code-of-gap 4))
#+END_SRC

#+RESULTS:
| 100 | 000 | 1100 | 1101 |

#+BEGIN_SRC elisp :results silent
  
  ;;;; PSEUDOCODE
  ;; Start an empty string
  ;; Loop through the list of gaps
    ;; for the given gap
    ;; find the code associated with that gap.
    ;; append that code to the accumulated encoded string.

#+END_SRC

--> ENCODING FUNCTION (Mapping Version)
---> Some serious help from Bro Neff here. 
#+BEGIN_SRC elisp :results silent
  (defun get-encoded-primes () 
    (mapconcat
      ;; FUNCTION
      (lambda (gap-size) (get-code-of-gap gap-size))
      ;; SEQUENCE
      list-of-gaps
      ;; SEPARATOR
      ""
      )
    )
#+END_SRC

#+BEGIN_SRC elisp
  (setq encoded-primes (get-encoded-primes)
        len-encoded (length encoded-primes))
#+END_SRC

#+RESULTS:
: 44712373

*** Encode-First-Ten-Million-Primes Function

    Encapsulate steps #1-5 in a function.

    This requires running pretty much all the source blocks previous to this.

#+BEGIN_SRC elisp :results raw

  (let ((x 5))

    ;; we will redo the list-of-nodes (which restarts the node-counter).
    (setq list-of-nodes (make-node-list-from-table f-table))
    ;; We need a backup list so that we don't kill it as we go through
    ;; the huffman-tree-building algorithm.
    (setq backup-list-of-nodes
          (loop for sym in list-of-nodes
                collect sym))
    (setq huffman-tree (make-huffman-tree list-of-nodes))
    (setq gap-code-table (get-a-gap-code-table))

    (setq encoded-primes (get-encoded-primes)
          len-encoded (length encoded-primes))
    ;;encoded-primes ;; return that.
    len-encoded
  )


#+END_SRC

#+RESULTS:
44712373

That's 44712373 bits in the huffman-encoding of the first ten million primes.

*** total number of bits (huffman encoding)
   : I correctly calculated the total number of bits encoded with the Huffman
   : encoding.

   #+BEGIN_SRC elisp
   ; v is the average number of bits per symbol in huffman
   ; 83,484,449 is the number of symbols in the prime list

   (setq encoded-huffman-bits 44712373.0)
   (setq huffman-percentage (/ encoded-huffman-bits 83484449.0))
   #+END_SRC

   #+RESULTS:
   : 0.5355772666116536

*** Compression Ratio (fixed to huffman)
   : I correctly calculated the compression ratio from this fixed encoding.

   The compression ratio of an encoding is the percentage ((f−v)/f)⋅100, where f is
   the number of bits per symbol of the smallest fixed-length encoding, and v is
   the average number of bits per symbol with the variable-length (e.g. Huffman)
   encoding.
   
   #+BEGIN_SRC elisp :results silent
   ;; f = number of bits per symbol of fixed length encoding
   ;; v = average number of bits per symbol for huffman encoding
   (defun compression-ratio (f v)
      (* (/ (- f v) f) 100))
   #+END_SRC

   #+BEGIN_SRC elisp
     ; total size / number of characters. this is encoded as gaps instead of the
     ; prime numbers, that way we can use 7 bits instead of a fixed number of bits
     ; that fits the largest prime in it.
     (compression-ratio (/ (* 7.0 9999998.0) 83484449.0)  huffman-percentage)
   #+END_SRC

   #+RESULTS:
   : 36.12516865360516

   36%

*** Compression Ratio (binary to huffman)
   : I correctly calculated the compression ratio from the binary size.

   #+BEGIN_SRC elisp
   ; total size in bits = 32 bits per prime number * number of prime numbers
   ; f = total size / number of characters
   (compression-ratio (/ (* 32.0 10000000.0) 83484449.0) huffman-percentage)
   #+END_SRC

   #+RESULTS:
   : 86.0273834375

   86%

*** Compression Ratio (ASCII to huffman)
   : I correctly calculated the compression ratio from the ASCII size (just
   : the primes, nothing else).

   #+BEGIN_SRC elisp
   ; this is the total size in bits divided by the number of characters
   (compression-ratio (/ 747875600.0 83484449.0) huffman-percentage)
   #+END_SRC

   #+RESULTS:
   : 94.02141572742848

   94%

